openfoam/3D/supersonic_sphere_re300/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vertices
(
    (-40.0 0.0 0.0)
    (40.0 0.0 0.0)
    (40.0 40.0 0.0)
    (-40.0 40.0 0.0)
    (-40.0 0.0 40.0)
    (40.0  0.0 40.0)
    (40.0 40.0 40.0)
    (-40.0 40.0 40.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (24 12 12) simpleGrading (1 1 1)
);

boundary
(
    freeStream
    {
        type patch;
        faces ((1 2 6 5)
               (0 4 7 3)
               (2 3 7 6)
               (4 5 6 7));
    }
    
    symSide
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }
    symBottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }




);

mergePatchPairs
(
);


// ************************************************************************* //
