openfoam/3D/supersonic_sphere_re300/system/samplePwall
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;
writeFields     true;

surfaceFormat   raw;
regionType      patch;
name            wing;

operation       none;

fields
(
    p
    yPlus
    wallShearStress
);
