openfoam/3D/supersonic_sphere_re300/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

# BlockMesh
runApplication blockMesh
runApplication snappyHexMesh -overwrite
runApplication transformPoints -scale '5.558E-06'
restore0Dir
runApplication rhoPimpleFoam
rhoPimpleFoam -latestTime -postProcess -func Graphs > log.postProcess
./prepareForceDat
#------------------------------------------------------------------------------
